[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:17:9
 {
     public static IServiceCollection AddWebServices(this IServiceCollection services)
     {
-        services.AddDatabaseDeveloperPageExceptionFilter();
+        ;
 
         services.AddScoped<IUser, CurrentUser>();

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:19:9
     {
         services.AddDatabaseDeveloperPageExceptionFilter();
 
-        services.AddScoped<IUser, CurrentUser>();
+        ;
 
         services.AddHttpContextAccessor();

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:21:9
 
         services.AddScoped<IUser, CurrentUser>();
 
-        services.AddHttpContextAccessor();
+        ;
 
         services.AddHealthChecks()

[Killed] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:23:9
 
         services.AddHttpContextAccessor();
 
-        services.AddHealthChecks()
-            .AddDbContextCheck<ApplicationDbContext>();
+        ;
 
         services.AddExceptionHandler<CustomExceptionHandler>();
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:26:9
         services.AddHealthChecks()
             .AddDbContextCheck<ApplicationDbContext>();
 
-        services.AddExceptionHandler<CustomExceptionHandler>();
+        ;
 
         services.AddRazorPages();

[Killed] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:28:9
 
         services.AddExceptionHandler<CustomExceptionHandler>();
 
-        services.AddRazorPages();
+        ;
 
         services.AddScoped(provider =>
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:30:9
 
         services.AddRazorPages();
 
-        services.AddScoped(provider =>
-        {
-            var validationRules = provider.GetService<IEnumerable<FluentValidationRule>>();
-            var loggerFactory = provider.GetService<ILoggerFactory>();
-
-            return new FluentValidationSchemaProcessor(provider, validationRules, loggerFactory);
-        });
+        ;
 
         // Customise default API behaviour

[NoCoverage] Block removal mutation
CA.Mutation/src/Web/DependencyInjection.cs:31:9
         services.AddRazorPages();
 
         services.AddScoped(provider =>
-        {
-            var validationRules = provider.GetService<IEnumerable<FluentValidationRule>>();
-            var loggerFactory = provider.GetService<ILoggerFactory>();
-
-            return new FluentValidationSchemaProcessor(provider, validationRules, loggerFactory);
-        });
+        {});
 
         // Customise default API behaviour

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:39:9
         });
 
         // Customise default API behaviour
-        services.Configure<ApiBehaviorOptions>(options =>
-            options.SuppressModelStateInvalidFilter = true);
+        ;
 
         services.AddEndpointsApiExplorer();

[Survived] Boolean mutation
CA.Mutation/src/Web/DependencyInjection.cs:40:55
 
         // Customise default API behaviour
         services.Configure<ApiBehaviorOptions>(options =>
-            options.SuppressModelStateInvalidFilter = true);
+            options.SuppressModelStateInvalidFilter = false);
 
         services.AddEndpointsApiExplorer();

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:42:9
         services.Configure<ApiBehaviorOptions>(options =>
             options.SuppressModelStateInvalidFilter = true);
 
-        services.AddEndpointsApiExplorer();
+        ;
 
         services.AddOpenApiDocument((configure, sp) =>

[Survived] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:44:9
 
         services.AddEndpointsApiExplorer();
 
-        services.AddOpenApiDocument((configure, sp) =>
-        {
-            configure.Title = "CA.Mutation API";
-
-            // Add the fluent validations schema processor
-            var fluentValidationSchemaProcessor = 
-                sp.CreateScope().ServiceProvider.GetRequiredService<FluentValidationSchemaProcessor>();
-
-            configure.SchemaProcessors.Add(fluentValidationSchemaProcessor);
-
-            // Add JWT
-            configure.AddSecurity("JWT", Enumerable.Empty<string>(), new OpenApiSecurityScheme
-            {
-                Type = OpenApiSecuritySchemeType.ApiKey,
-                Name = "Authorization",
-                In = OpenApiSecurityApiKeyLocation.Header,
-                Description = "Type into the textbox: Bearer {your JWT token}."
-            });
-
-            configure.OperationProcessors.Add(new AspNetCoreOperationSecurityScopeProcessor("JWT"));
-        });
+        ;
 
         return services;

[NoCoverage] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:52:13
             var fluentValidationSchemaProcessor = 
                 sp.CreateScope().ServiceProvider.GetRequiredService<FluentValidationSchemaProcessor>();
 
-            configure.SchemaProcessors.Add(fluentValidationSchemaProcessor);
+            ;
 
             // Add JWT

[NoCoverage] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:63:13
                 Description = "Type into the textbox: Bearer {your JWT token}."
             });
 
-            configure.OperationProcessors.Add(new AspNetCoreOperationSecurityScopeProcessor("JWT"));
+            ;
         });
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
CA.Mutation/src/Web/DependencyInjection.cs:72:13
     public static IServiceCollection AddKeyVaultIfConfigured(this IServiceCollection services, ConfigurationManager configuration)
     {
         var keyVaultUri = configuration["KeyVaultUri"];
-        if (!string.IsNullOrWhiteSpace(keyVaultUri))
+        if (string.IsNullOrWhiteSpace(keyVaultUri))
         {
             configuration.AddAzureKeyVault(
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[NoCoverage] Statement mutation
CA.Mutation/src/Web/DependencyInjection.cs:74:13
         var keyVaultUri = configuration["KeyVaultUri"];
         if (!string.IsNullOrWhiteSpace(keyVaultUri))
         {
-            configuration.AddAzureKeyVault(
-                new Uri(keyVaultUri),
-                new DefaultAzureCredential());
+            ;
         }
 
