[Survived] Statement mutation
src/Web/Endpoints/Users.cs:9:9
 {
     public override void Map(WebApplication app)
     {
-        app.MapGroup(this)
-            .MapIdentityApi<ApplicationUser>();
+        ;
     }
 }
