[Survived] Statement mutation
src/Web/Endpoints/TodoItems.cs:14:9
 {
     public override void Map(WebApplication app)
     {
-        app.MapGroup(this)
-            .RequireAuthorization()
-            .MapGet(GetTodoItemsWithPagination)
-            .MapPost(CreateTodoItem)
-            .MapPut(UpdateTodoItem, "{id}")
-            .MapPut(UpdateTodoItemDetail, "UpdateDetail/{id}")
-            .MapDelete(DeleteTodoItem, "{id}");
+        ;
     }
 

[NoCoverage] Block removal mutation
src/Web/Endpoints/TodoItems.cs:24:5
     }
 
     public async Task<PaginatedList<TodoItemBriefDto>> GetTodoItemsWithPagination(ISender sender, [AsParameters] GetTodoItemsWithPaginationQuery query)
-    {
-        return await sender.Send(query);
-    }
+    {}
 
     public async Task<int> CreateTodoItem(ISender sender, CreateTodoItemCommand command)

[NoCoverage] Block removal mutation
src/Web/Endpoints/TodoItems.cs:29:5
     }
 
     public async Task<int> CreateTodoItem(ISender sender, CreateTodoItemCommand command)
-    {
-        return await sender.Send(command);
-    }
+    {}
 
     public async Task<IResult> UpdateTodoItem(ISender sender, int id, UpdateTodoItemCommand command)

[NoCoverage] Equality mutation
src/Web/Endpoints/TodoItems.cs:35:13
 
     public async Task<IResult> UpdateTodoItem(ISender sender, int id, UpdateTodoItemCommand command)
     {
-        if (id != command.Id) return Results.BadRequest();
+        if (id == command.Id) return Results.BadRequest();
         await sender.Send(command);
         return Results.NoContent();

[NoCoverage] Statement mutation
src/Web/Endpoints/TodoItems.cs:36:9
     public async Task<IResult> UpdateTodoItem(ISender sender, int id, UpdateTodoItemCommand command)
     {
         if (id != command.Id) return Results.BadRequest();
-        await sender.Send(command);
+        ;
         return Results.NoContent();
     }

[NoCoverage] Statement mutation
src/Web/Endpoints/TodoItems.cs:49:9
 
     public async Task<IResult> DeleteTodoItem(ISender sender, int id)
     {
-        await sender.Send(new DeleteTodoItemCommand(id));
+        ;
         return Results.NoContent();
     }
