[Survived] Block removal mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:12:5
     private readonly Dictionary<Type, Func<HttpContext, Exception, Task>> _exceptionHandlers;
 
     public CustomExceptionHandler()
-    {
-        // Register known exception types and handlers.
-        _exceptionHandlers = new()
-            {
-                { typeof(ValidationException), HandleValidationException },
-                { typeof(NotFoundException), HandleNotFoundException },
-                { typeof(UnauthorizedAccessException), HandleUnauthorizedAccessException },
-                { typeof(ForbiddenAccessException), HandleForbiddenAccessException },
-            };
-    }
+    {}
 
     public async ValueTask<bool> TryHandleAsync(HttpContext httpContext, Exception exception, CancellationToken cancellationToken)

[NoCoverage] Negate expression
src/Web/Infrastructure/CustomExceptionHandler.cs:27:13
     {
         var exceptionType = exception.GetType();
 
-        if (_exceptionHandlers.ContainsKey(exceptionType))
+        if (!(_exceptionHandlers.ContainsKey(exceptionType)))
         {
             await _exceptionHandlers[exceptionType].Invoke(httpContext, exception);

[NoCoverage] Statement mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:29:13
 
         if (_exceptionHandlers.ContainsKey(exceptionType))
         {
-            await _exceptionHandlers[exceptionType].Invoke(httpContext, exception);
+            ;
             return true;
         }

[NoCoverage] Boolean mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:30:20
         if (_exceptionHandlers.ContainsKey(exceptionType))
         {
             await _exceptionHandlers[exceptionType].Invoke(httpContext, exception);
-            return true;
+            return false;
         }
 

[NoCoverage] Block removal mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:37:5
     }
 
     private async Task HandleValidationException(HttpContext httpContext, Exception ex)
-    {
-        var exception = (ValidationException)ex;
-
-        httpContext.Response.StatusCode = StatusCodes.Status400BadRequest;
-
-        await httpContext.Response.WriteAsJsonAsync(new ValidationProblemDetails(exception.Errors)
-        {
-            Status = StatusCodes.Status400BadRequest,
-            Type = "https://tools.ietf.org/html/rfc7231#section-6.5.1"
-        });
-    }
+    {}
 
     private async Task HandleNotFoundException(HttpContext httpContext, Exception ex)

[NoCoverage] Block removal mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:50:5
     }
 
     private async Task HandleNotFoundException(HttpContext httpContext, Exception ex)
-    {
-        var exception = (NotFoundException)ex;
-
-        httpContext.Response.StatusCode = StatusCodes.Status404NotFound;
-
-        await httpContext.Response.WriteAsJsonAsync(new ProblemDetails()
-        {
-            Status = StatusCodes.Status404NotFound,
-            Type = "https://tools.ietf.org/html/rfc7231#section-6.5.4",
-            Title = "The specified resource was not found.",
-            Detail = exception.Message
-        });
-    }
+    {}
 
     private async Task HandleUnauthorizedAccessException(HttpContext httpContext, Exception ex)

[NoCoverage] Block removal mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:65:5
     }
 
     private async Task HandleUnauthorizedAccessException(HttpContext httpContext, Exception ex)
-    {
-        httpContext.Response.StatusCode = StatusCodes.Status401Unauthorized;
-
-        await httpContext.Response.WriteAsJsonAsync(new ProblemDetails
-        {
-            Status = StatusCodes.Status401Unauthorized,
-            Title = "Unauthorized",
-            Type = "https://tools.ietf.org/html/rfc7235#section-3.1"
-        });
-    }
+    {}
 
     private async Task HandleForbiddenAccessException(HttpContext httpContext, Exception ex)

[NoCoverage] Block removal mutation
src/Web/Infrastructure/CustomExceptionHandler.cs:77:5
     }
 
     private async Task HandleForbiddenAccessException(HttpContext httpContext, Exception ex)
-    {
-        httpContext.Response.StatusCode = StatusCodes.Status403Forbidden;
-
-        await httpContext.Response.WriteAsJsonAsync(new ProblemDetails
-        {
-            Status = StatusCodes.Status403Forbidden,
-            Title = "Forbidden",
-            Type = "https://tools.ietf.org/html/rfc7231#section-6.5.3"
-        });
-    }
+    {}
 }
 
