[Survived] Statement mutation
src/Web/Infrastructure/IEndpointRouteBuilderExtensions.cs:7:9
 {
     public static IEndpointRouteBuilder MapGet(this IEndpointRouteBuilder builder, Delegate handler, string pattern = "")
     {
-        Guard.Against.AnonymousMethod(handler);
+        ;
 
         builder.MapGet(pattern, handler)

[Survived] Statement mutation
src/Web/Infrastructure/IEndpointRouteBuilderExtensions.cs:9:9
     {
         Guard.Against.AnonymousMethod(handler);
 
-        builder.MapGet(pattern, handler)
-            .WithName(handler.Method.Name);
+        ;
 
         return builder;

[Survived] Statement mutation
src/Web/Infrastructure/IEndpointRouteBuilderExtensions.cs:19:9
     {
         Guard.Against.AnonymousMethod(handler);
 
-        builder.MapPost(pattern, handler)
-            .WithName(handler.Method.Name);
+        ;
 
         return builder;

[Survived] Statement mutation
src/Web/Infrastructure/IEndpointRouteBuilderExtensions.cs:29:9
     {
         Guard.Against.AnonymousMethod(handler);
 
-        builder.MapPut(pattern, handler)
-            .WithName(handler.Method.Name);
+        ;
 
         return builder;

[Survived] Statement mutation
src/Web/Infrastructure/IEndpointRouteBuilderExtensions.cs:39:9
     {
         Guard.Against.AnonymousMethod(handler);
 
-        builder.MapDelete(pattern, handler)
-            .WithName(handler.Method.Name);
+        ;
 
         return builder;
