[Survived] Statement mutation
src/Web/Endpoints/TodoLists.cs:12:9
 {
     public override void Map(WebApplication app)
     {
-        app.MapGroup(this)
-            .RequireAuthorization()
-            .MapGet(GetTodoLists)
-            .MapPost(CreateTodoList)
-            .MapPut(UpdateTodoList, "{id}")
-            .MapDelete(DeleteTodoList, "{id}");
+        ;
     }
 

[NoCoverage] Block removal mutation
src/Web/Endpoints/TodoLists.cs:21:5
     }
 
     public async Task<TodosVm> GetTodoLists(ISender sender)
-    {
-        return await sender.Send(new GetTodosQuery());
-    }
+    {}
 
     public async Task<int> CreateTodoList(ISender sender, CreateTodoListCommand command)

[NoCoverage] Block removal mutation
src/Web/Endpoints/TodoLists.cs:26:5
     }
 
     public async Task<int> CreateTodoList(ISender sender, CreateTodoListCommand command)
-    {
-        return await sender.Send(command);
-    }
+    {}
 
     public async Task<IResult> UpdateTodoList(ISender sender, int id, UpdateTodoListCommand command)

[NoCoverage] Statement mutation
src/Web/Endpoints/TodoLists.cs:39:9
 
     public async Task<IResult> DeleteTodoList(ISender sender, int id)
     {
-        await sender.Send(new DeleteTodoListCommand(id));
+        ;
         return Results.NoContent();
     }
