[Survived] Linq method mutation (Any() to All())
src/Web/Infrastructure/MethodInfoExtensions.cs:10:16
     public static bool IsAnonymous(this MethodInfo method)
     {
         var invalidChars = new[] { '<', '>' };
-        return method.Name.Any(invalidChars.Contains);
+        return method.Name.All(invalidChars.Contains);
     }
 

[Killed] Negate expression
src/Web/Infrastructure/MethodInfoExtensions.cs:15:13
 
     public static void AnonymousMethod(this IGuardClause guardClause, Delegate input)
     {
-        if (input.Method.IsAnonymous())
+        if (!(input.Method.IsAnonymous()))
             throw new ArgumentException("The endpoint name must be specified when using anonymous handlers.");
     }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[NoCoverage] Statement mutation
src/Web/Infrastructure/MethodInfoExtensions.cs:16:13
     public static void AnonymousMethod(this IGuardClause guardClause, Delegate input)
     {
         if (input.Method.IsAnonymous())
-            throw new ArgumentException("The endpoint name must be specified when using anonymous handlers.");
+            ;
     }
 }
