[Survived] Statement mutation
src/Web/Endpoints/WeatherForecasts.cs:9:9
 {
     public override void Map(WebApplication app)
     {
-        app.MapGroup(this)
-            .RequireAuthorization()
-            .MapGet(GetWeatherForecasts);
+        ;
     }
 

[NoCoverage] Block removal mutation
src/Web/Endpoints/WeatherForecasts.cs:15:5
     }
 
     public async Task<IEnumerable<WeatherForecast>> GetWeatherForecasts(ISender sender)
-    {
-        return await sender.Send(new GetWeatherForecastsQuery());
-    }
+    {}
 }
 
