[Killed] Block removal mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:17:5
     public AuditableEntityInterceptor(
         IUser user,
         TimeProvider dateTime)
-    {
-        _user = user;
-        _dateTime = dateTime;
-    }
+    {}
 
     public override InterceptionResult<int> SavingChanges(DbContextEventData eventData, InterceptionResult<int> result)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[NoCoverage] Statement mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:24:9
 
     public override InterceptionResult<int> SavingChanges(DbContextEventData eventData, InterceptionResult<int> result)
     {
-        UpdateEntities(eventData.Context);
+        ;
 
         return base.SavingChanges(eventData, result);

[Killed] Equality mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:42:17
 
         foreach (var entry in context.ChangeTracker.Entries<BaseAuditableEntity>())
         {
-            if (entry.State == EntityState.Added)
+            if (entry.State != EntityState.Added)
             {
                 entry.Entity.CreatedBy = _user.Id;
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.CreateTodoListTests.ShouldCreateTodoList

[Killed] Block removal mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:43:13
         foreach (var entry in context.ChangeTracker.Entries<BaseAuditableEntity>())
         {
             if (entry.State == EntityState.Added)
-            {
-                entry.Entity.CreatedBy = _user.Id;
-                entry.Entity.Created = _dateTime.GetUtcNow();
-            } 
+            {} 
 
             if (entry.State == EntityState.Added || entry.State == EntityState.Modified || entry.HasChangedOwnedEntities())
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem

[Killed] Logical mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:48:17
                 entry.Entity.Created = _dateTime.GetUtcNow();
             } 
 
-            if (entry.State == EntityState.Added || entry.State == EntityState.Modified || entry.HasChangedOwnedEntities())
+            if (entry.State == EntityState.Added || entry.State == EntityState.Modified && entry.HasChangedOwnedEntities())
             {
                 entry.Entity.LastModifiedBy = _user.Id;
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[Killed] Equality mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:48:17
                 entry.Entity.Created = _dateTime.GetUtcNow();
             } 
 
-            if (entry.State == EntityState.Added || entry.State == EntityState.Modified || entry.HasChangedOwnedEntities())
+            if (entry.State != EntityState.Added || entry.State == EntityState.Modified || entry.HasChangedOwnedEntities())
             {
                 entry.Entity.LastModifiedBy = _user.Id;
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem

[Killed] Block removal mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:49:13
             } 
 
             if (entry.State == EntityState.Added || entry.State == EntityState.Modified || entry.HasChangedOwnedEntities())
-            {
-                entry.Entity.LastModifiedBy = _user.Id;
-                entry.Entity.LastModified = _dateTime.GetUtcNow();
-            }
+            {}
         }
     }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[Survived] Linq method mutation (Any() to All())
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:60:9
 public static class Extensions
 {
     public static bool HasChangedOwnedEntities(this EntityEntry entry) =>
-        entry.References.Any(r => 
-            r.TargetEntry != null && 
-            r.TargetEntry.Metadata.IsOwned() && 
-            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
+        entry.References.All(r => 
+            r.TargetEntry != null && 
+            r.TargetEntry.Metadata.IsOwned() && 
+            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
 }
 

[Killed] Logical mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:61:13
 {
     public static bool HasChangedOwnedEntities(this EntityEntry entry) =>
         entry.References.Any(r => 
-            r.TargetEntry != null && 
-            r.TargetEntry.Metadata.IsOwned() && 
+            r.TargetEntry != null || 
+            r.TargetEntry.Metadata.IsOwned() && 
             (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
 }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Logical mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:61:13
 {
     public static bool HasChangedOwnedEntities(this EntityEntry entry) =>
         entry.References.Any(r => 
-            r.TargetEntry != null && 
-            r.TargetEntry.Metadata.IsOwned() && 
-            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
+            r.TargetEntry != null && 
+            r.TargetEntry.Metadata.IsOwned() || 
+            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
 }
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Equality mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:63:58
         entry.References.Any(r => 
             r.TargetEntry != null && 
             r.TargetEntry.Metadata.IsOwned() && 
-            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
+            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State != EntityState.Modified));
 }
 

[Survived] Logical mutation
Infrastructure/Data/Interceptors/AuditableEntityInterceptor.cs:63:14
         entry.References.Any(r => 
             r.TargetEntry != null && 
             r.TargetEntry.Metadata.IsOwned() && 
-            (r.TargetEntry.State == EntityState.Added || r.TargetEntry.State == EntityState.Modified));
+            (r.TargetEntry.State == EntityState.Added && r.TargetEntry.State == EntityState.Modified));
 }
 
