[Timeout] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:19:9
     {
         var connectionString = configuration.GetConnectionString("DefaultConnection");
 
-        Guard.Against.Null(connectionString, message: "Connection string 'DefaultConnection' not found.");
+        ;
 
         services.AddScoped<ISaveChangesInterceptor, AuditableEntityInterceptor>();

[Timeout] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:21:9
 
         Guard.Against.Null(connectionString, message: "Connection string 'DefaultConnection' not found.");
 
-        services.AddScoped<ISaveChangesInterceptor, AuditableEntityInterceptor>();
+        ;
         services.AddScoped<ISaveChangesInterceptor, DispatchDomainEventsInterceptor>();
 

[Timeout] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:22:9
         Guard.Against.Null(connectionString, message: "Connection string 'DefaultConnection' not found.");
 
         services.AddScoped<ISaveChangesInterceptor, AuditableEntityInterceptor>();
-        services.AddScoped<ISaveChangesInterceptor, DispatchDomainEventsInterceptor>();
+        ;
 
         services.AddDbContext<ApplicationDbContext>((sp, options) =>

[Timeout] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:24:9
         services.AddScoped<ISaveChangesInterceptor, AuditableEntityInterceptor>();
         services.AddScoped<ISaveChangesInterceptor, DispatchDomainEventsInterceptor>();
 
-        services.AddDbContext<ApplicationDbContext>((sp, options) =>
-        {
-            options.AddInterceptors(sp.GetServices<ISaveChangesInterceptor>());
-
-            options.UseSqlServer(connectionString);
-        });
+        ;
 
         services.AddScoped<IApplicationDbContext>(provider => provider.GetRequiredService<ApplicationDbContext>());

[NoCoverage] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:26:13
 
         services.AddDbContext<ApplicationDbContext>((sp, options) =>
         {
-            options.AddInterceptors(sp.GetServices<ISaveChangesInterceptor>());
+            ;
 
             options.UseSqlServer(connectionString);

[NoCoverage] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:28:13
         {
             options.AddInterceptors(sp.GetServices<ISaveChangesInterceptor>());
 
-            options.UseSqlServer(connectionString);
+            ;
         });
 

[Killed] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:31:9
             options.UseSqlServer(connectionString);
         });
 
-        services.AddScoped<IApplicationDbContext>(provider => provider.GetRequiredService<ApplicationDbContext>());
+        ;
 
         services.AddScoped<ApplicationDbContextInitialiser>();
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:33:9
 
         services.AddScoped<IApplicationDbContext>(provider => provider.GetRequiredService<ApplicationDbContext>());
 
-        services.AddScoped<ApplicationDbContextInitialiser>();
+        ;
 
         services.AddAuthentication()
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:35:9
 
         services.AddScoped<ApplicationDbContextInitialiser>();
 
-        services.AddAuthentication()
-            .AddBearerToken(IdentityConstants.BearerScheme);
+        ;
 
         services.AddAuthorizationBuilder();

[Survived] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:38:9
         services.AddAuthentication()
             .AddBearerToken(IdentityConstants.BearerScheme);
 
-        services.AddAuthorizationBuilder();
+        ;
 
         services

[Killed] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:40:9
 
         services.AddAuthorizationBuilder();
 
-        services
-            .AddIdentityCore<ApplicationUser>()
-            .AddRoles<IdentityRole>()
-            .AddEntityFrameworkStores<ApplicationDbContext>()
-            .AddApiEndpoints();
+        ;
 
         services.AddSingleton(TimeProvider.System);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:46:9
             .AddEntityFrameworkStores<ApplicationDbContext>()
             .AddApiEndpoints();
 
-        services.AddSingleton(TimeProvider.System);
+        ;
         services.AddTransient<IIdentityService, IdentityService>();
 

[Killed] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:47:9
             .AddApiEndpoints();
 
         services.AddSingleton(TimeProvider.System);
-        services.AddTransient<IIdentityService, IdentityService>();
+        ;
 
         services.AddAuthorization(options =>
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
CA.Mutation/src/Infrastructure/DependencyInjection.cs:49:9
         services.AddSingleton(TimeProvider.System);
         services.AddTransient<IIdentityService, IdentityService>();
 
-        services.AddAuthorization(options =>
-            options.AddPolicy(Policies.CanPurge, policy => policy.RequireRole(Roles.Administrator)));
+        ;
 
         return services;
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists
