[NoCoverage] Block removal mutation
src/Web/Pages/Error.cshtml.cs:13:5
     private readonly ILogger<ErrorModel> _logger;
 
     public ErrorModel(ILogger<ErrorModel> logger)
-    {
-        _logger = logger;
-    }
+    {}
 
     public string? RequestId { get; set; }

[NoCoverage] Null coalescing mutation (left to right)
src/Web/Pages/Error.cshtml.cs:23:21
 
     public void OnGet()
     {
-        RequestId = Activity.Current?.Id ?? HttpContext.TraceIdentifier;
+        RequestId = HttpContext.TraceIdentifier ?? Activity.Current?.Id;
     }
 }

[NoCoverage] Null coalescing mutation (remove left)
src/Web/Pages/Error.cshtml.cs:23:21
 
     public void OnGet()
     {
-        RequestId = Activity.Current?.Id ?? HttpContext.TraceIdentifier;
+        RequestId = Activity.Current?.Id;
     }
 }
