[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:6:1
 var builder = WebApplication.CreateBuilder(args);
 
 // Add services to the container.
-builder.Services.AddKeyVaultIfConfigured(builder.Configuration);
+;
 
 builder.Services.AddApplicationServices();

[Killed] Statement mutation
CA.Mutation/src/Web/Program.cs:8:1
 // Add services to the container.
 builder.Services.AddKeyVaultIfConfigured(builder.Configuration);
 
-builder.Services.AddApplicationServices();
+;
 builder.Services.AddInfrastructureServices(builder.Configuration);
 builder.Services.AddWebServices();
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
CA.Mutation/src/Web/Program.cs:9:1
 builder.Services.AddKeyVaultIfConfigured(builder.Configuration);
 
 builder.Services.AddApplicationServices();
-builder.Services.AddInfrastructureServices(builder.Configuration);
+;
 builder.Services.AddWebServices();
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
CA.Mutation/src/Web/Program.cs:10:1
 
 builder.Services.AddApplicationServices();
 builder.Services.AddInfrastructureServices(builder.Configuration);
-builder.Services.AddWebServices();
+;
 
 var app = builder.Build();
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Negate expression
CA.Mutation/src/Web/Program.cs:15:5
 var app = builder.Build();
 
 // Configure the HTTP request pipeline.
-if (app.Environment.IsDevelopment())
+if (!(app.Environment.IsDevelopment()))
 {
     await app.InitialiseDatabaseAsync();

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:17:5
 // Configure the HTTP request pipeline.
 if (app.Environment.IsDevelopment())
 {
-    await app.InitialiseDatabaseAsync();
+    ;
 }
 else

[NoCoverage] Statement mutation
CA.Mutation/src/Web/Program.cs:22:5
 else
 {
     // The default HSTS value is 30 days. You may want to change this for production scenarios, see https://aka.ms/aspnetcore-hsts.
-    app.UseHsts();
+    ;
 }
 

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:25:1
     app.UseHsts();
 }
 
-app.UseHealthChecks("/health");
+;
 app.UseHttpsRedirection();
 app.UseStaticFiles();

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:26:1
 }
 
 app.UseHealthChecks("/health");
-app.UseHttpsRedirection();
+;
 app.UseStaticFiles();
 

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:27:1
 
 app.UseHealthChecks("/health");
 app.UseHttpsRedirection();
-app.UseStaticFiles();
+;
 
 app.UseSwaggerUi3(settings =>

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:29:1
 app.UseHttpsRedirection();
 app.UseStaticFiles();
 
-app.UseSwaggerUi3(settings =>
-{
-    settings.Path = "/api";
-    settings.DocumentPath = "/api/specification.json";
-});
+;
 
 app.MapControllerRoute(

[Survived] Block removal mutation
CA.Mutation/src/Web/Program.cs:30:1
 app.UseStaticFiles();
 
 app.UseSwaggerUi3(settings =>
-{
-    settings.Path = "/api";
-    settings.DocumentPath = "/api/specification.json";
-});
+{});
 
 app.MapControllerRoute(

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:35:1
     settings.DocumentPath = "/api/specification.json";
 });
 
-app.MapControllerRoute(
-    name: "default",
-    pattern: "{controller}/{action=Index}/{id?}");
+;
 
 app.MapRazorPages();

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:39:1
     name: "default",
     pattern: "{controller}/{action=Index}/{id?}");
 
-app.MapRazorPages();
+;
 
 app.MapFallbackToFile("index.html");

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:41:1
 
 app.MapRazorPages();
 
-app.MapFallbackToFile("index.html");
+;
 
 app.UseExceptionHandler(options => { });

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:43:1
 
 app.MapFallbackToFile("index.html");
 
-app.UseExceptionHandler(options => { });
+;
 
 app.Map("/", () => Results.Redirect("/api"));

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:45:1
 
 app.UseExceptionHandler(options => { });
 
-app.Map("/", () => Results.Redirect("/api"));
+;
 
 app.MapEndpoints();

[Survived] Statement mutation
CA.Mutation/src/Web/Program.cs:47:1
 
 app.Map("/", () => Results.Redirect("/api"));
 
-app.MapEndpoints();
+;
 
 app.Run();
