[Killed] Block removal mutation
src/Infrastructure/Identity/IdentityService.cs:19:5
         UserManager<ApplicationUser> userManager,
         IUserClaimsPrincipalFactory<ApplicationUser> userClaimsPrincipalFactory,
         IAuthorizationService authorizationService)
-    {
-        _userManager = userManager;
-        _userClaimsPrincipalFactory = userClaimsPrincipalFactory;
-        _authorizationService = authorizationService;
-    }
+    {}
 
     public async Task<string?> GetUserNameAsync(string userId)
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDenyNonAdministrator

[NoCoverage] Equality mutation
src/Infrastructure/Identity/IdentityService.cs:27:61
 
     public async Task<string?> GetUserNameAsync(string userId)
     {
-        var user = await _userManager.Users.FirstAsync(u => u.Id == userId);
+        var user = await _userManager.Users.FirstAsync(u => u.Id != userId);
 
         return user.UserName;

[NoCoverage] Block removal mutation
src/Infrastructure/Identity/IdentityService.cs:33:5
     }
 
     public async Task<(Result Result, string UserId)> CreateUserAsync(string userName, string password)
-    {
-        var user = new ApplicationUser
-        {
-            UserName = userName,
-            Email = userName,
-        };
-
-        var result = await _userManager.CreateAsync(user, password);
-
-        return (result.ToApplicationResult(), user.Id);
-    }
+    {}
 
     public async Task<bool> IsInRoleAsync(string userId, string role)

[Killed] Equality mutation
src/Infrastructure/Identity/IdentityService.cs:47:60
 
     public async Task<bool> IsInRoleAsync(string userId, string role)
     {
-        var user = _userManager.Users.SingleOrDefault(u => u.Id == userId);
+        var user = _userManager.Users.SingleOrDefault(u => u.Id != userId);
 
         return user != null && await _userManager.IsInRoleAsync(user, role);
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Survived] Linq method mutation (SingleOrDefault() to Single())
src/Infrastructure/Identity/IdentityService.cs:47:20
 
     public async Task<bool> IsInRoleAsync(string userId, string role)
     {
-        var user = _userManager.Users.SingleOrDefault(u => u.Id == userId);
+        var user = _userManager.Users.Single(u => u.Id == userId);
 
         return user != null && await _userManager.IsInRoleAsync(user, role);

[Killed] Equality mutation
src/Infrastructure/Identity/IdentityService.cs:49:16
     {
         var user = _userManager.Users.SingleOrDefault(u => u.Id == userId);
 
-        return user != null && await _userManager.IsInRoleAsync(user, role);
+        return user == null && await _userManager.IsInRoleAsync(user, role);
     }
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Survived] Logical mutation
src/Infrastructure/Identity/IdentityService.cs:49:16
     {
         var user = _userManager.Users.SingleOrDefault(u => u.Id == userId);
 
-        return user != null && await _userManager.IsInRoleAsync(user, role);
+        return user != null || await _userManager.IsInRoleAsync(user, role);
     }
 

[NoCoverage] Equality mutation
src/Infrastructure/Identity/IdentityService.cs:72:16
     {
         var user = _userManager.Users.SingleOrDefault(u => u.Id == userId);
 
-        return user != null ? await DeleteUserAsync(user) : Result.Success();
+        return user == null ? await DeleteUserAsync(user) : Result.Success();
     }
 

[NoCoverage] Block removal mutation
src/Infrastructure/Identity/IdentityService.cs:76:5
     }
 
     public async Task<Result> DeleteUserAsync(ApplicationUser user)
-    {
-        var result = await _userManager.DeleteAsync(user);
-
-        return result.ToApplicationResult();
-    }
+    {}
 }
 
