[NoCoverage] Block removal mutation
src/Web/Services/CurrentUser.cs:12:5
     private readonly IHttpContextAccessor _httpContextAccessor;
 
     public CurrentUser(IHttpContextAccessor httpContextAccessor)
-    {
-        _httpContextAccessor = httpContextAccessor;
-    }
+    {}
 
     public string? Id => _httpContextAccessor.HttpContext?.User?.FindFirstValue(ClaimTypes.NameIdentifier);
