[Timeout] Block removal mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:16:5
     public AuthorizationBehaviour(
         IUser user,
         IIdentityService identityService)
-    {
-        _user = user;
-        _identityService = identityService;
-    }
+    {}
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)

[Timeout] Negate expression
Application/Common/Behaviours/AuthorizationBehaviour.cs:25:13
     {
         var authorizeAttributes = request.GetType().GetCustomAttributes<AuthorizeAttribute>();
 
-        if (authorizeAttributes.Any())
+        if (!(authorizeAttributes.Any()))
         {
             // Must be authenticated user

[Killed] Equality mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:28:17
         if (authorizeAttributes.Any())
         {
             // Must be authenticated user
-            if (_user.Id == null)
+            if (_user.Id != null)
             {
                 throw new UnauthorizedAccessException();
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDenyAnonymousUser; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDenyNonAdministrator

[Killed] Statement mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:30:17
             // Must be authenticated user
             if (_user.Id == null)
             {
-                throw new UnauthorizedAccessException();
+                ;
             }
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDenyAnonymousUser; CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldDenyAnonymousUser

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:34:79
             }
 
             // Role-based authorization
-            var authorizeAttributesWithRoles = authorizeAttributes.Where(a => !string.IsNullOrWhiteSpace(a.Roles));
+            var authorizeAttributesWithRoles = authorizeAttributes.Where(a => string.IsNullOrWhiteSpace(a.Roles));
 
             if (authorizeAttributesWithRoles.Any())
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDenyNonAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnAllListsAndItems

[Killed] Negate expression
Application/Common/Behaviours/AuthorizationBehaviour.cs:36:17
             // Role-based authorization
             var authorizeAttributesWithRoles = authorizeAttributes.Where(a => !string.IsNullOrWhiteSpace(a.Roles));
 
-            if (authorizeAttributesWithRoles.Any())
+            if (!(authorizeAttributesWithRoles.Any()))
             {
                 var authorized = false;
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnAllListsAndItems; CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnPriorityLevels

[Survived] Boolean mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:38:34
 
             if (authorizeAttributesWithRoles.Any())
             {
-                var authorized = false;
+                var authorized = true;
 
                 foreach (var roles in authorizeAttributesWithRoles.Select(a => a.Roles.Split(',')))

[Killed] Negate expression
Application/Common/Behaviours/AuthorizationBehaviour.cs:45:29
                     foreach (var role in roles)
                     {
                         var isInRole = await _identityService.IsInRoleAsync(_user.Id, role.Trim());
-                        if (isInRole)
+                        if (!(isInRole))
                         {
                             authorized = true;
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Killed] Boolean mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:47:42
                         var isInRole = await _identityService.IsInRoleAsync(_user.Id, role.Trim());
                         if (isInRole)
                         {
-                            authorized = true;
+                            authorized = false;
                             break;
                         }
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Survived] Statement mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:48:29
                         if (isInRole)
                         {
                             authorized = true;
-                            break;
+                            ;
                         }
                     }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:54:21
                 }
 
                 // Must be a member of at least one role in roles
-                if (!authorized)
+                if (authorized)
                 {
                     throw new ForbiddenAccessException();
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Survived] Statement mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:56:21
                 // Must be a member of at least one role in roles
                 if (!authorized)
                 {
-                    throw new ForbiddenAccessException();
+                    ;
                 }
             }

[Timeout] LogicalNotExpression to un-LogicalNotExpression mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:61:82
             }
 
             // Policy-based authorization
-            var authorizeAttributesWithPolicies = authorizeAttributes.Where(a => !string.IsNullOrWhiteSpace(a.Policy));
+            var authorizeAttributesWithPolicies = authorizeAttributes.Where(a => string.IsNullOrWhiteSpace(a.Policy));
             if (authorizeAttributesWithPolicies.Any())
             {

[Timeout] Negate expression
Application/Common/Behaviours/AuthorizationBehaviour.cs:62:17
 
             // Policy-based authorization
             var authorizeAttributesWithPolicies = authorizeAttributes.Where(a => !string.IsNullOrWhiteSpace(a.Policy));
-            if (authorizeAttributesWithPolicies.Any())
+            if (!(authorizeAttributesWithPolicies.Any()))
             {
                 foreach (var policy in authorizeAttributesWithPolicies.Select(a => a.Policy))

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Application/Common/Behaviours/AuthorizationBehaviour.cs:68:25
                 {
                     var authorized = await _identityService.AuthorizeAsync(_user.Id, policy);
 
-                    if (!authorized)
+                    if (authorized)
                     {
                         throw new ForbiddenAccessException();
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldAllowAdministrator; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists
