[Killed] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:10:9
 {
     public static IServiceCollection AddApplicationServices(this IServiceCollection services)
     {
-        services.AddAutoMapper(Assembly.GetExecutingAssembly());
+        ;
 
         services.AddValidatorsFromAssembly(Assembly.GetExecutingAssembly());
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Timeout] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:12:9
     {
         services.AddAutoMapper(Assembly.GetExecutingAssembly());
 
-        services.AddValidatorsFromAssembly(Assembly.GetExecutingAssembly());
+        ;
 
         services.AddMediatR(cfg => {

[Timeout] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:14:9
 
         services.AddValidatorsFromAssembly(Assembly.GetExecutingAssembly());
 
-        services.AddMediatR(cfg => {
-            cfg.RegisterServicesFromAssembly(Assembly.GetExecutingAssembly());
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(ValidationBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(PerformanceBehaviour<,>));
-        });
+        ;
 
         return services;

[Killed] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:15:13
         services.AddValidatorsFromAssembly(Assembly.GetExecutingAssembly());
 
         services.AddMediatR(cfg => {
-            cfg.RegisterServicesFromAssembly(Assembly.GetExecutingAssembly());
+            ;
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Timeout] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:16:13
 
         services.AddMediatR(cfg => {
             cfg.RegisterServicesFromAssembly(Assembly.GetExecutingAssembly());
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
+            ;
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(ValidationBehaviour<,>));

[Timeout] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:17:13
         services.AddMediatR(cfg => {
             cfg.RegisterServicesFromAssembly(Assembly.GetExecutingAssembly());
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
+            ;
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(ValidationBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(PerformanceBehaviour<,>));

[Killed] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:18:13
             cfg.RegisterServicesFromAssembly(Assembly.GetExecutingAssembly());
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(ValidationBehaviour<,>));
+            ;
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(PerformanceBehaviour<,>));
         });
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields

[Timeout] Statement mutation
CA.Mutation/src/Application/DependencyInjection.cs:19:13
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(UnhandledExceptionBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(AuthorizationBehaviour<,>));
             cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(ValidationBehaviour<,>));
-            cfg.AddBehavior(typeof(IPipelineBehavior<,>), typeof(PerformanceBehaviour<,>));
+            ;
         });
 
