[Timeout] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:21:9
 
         var initialiser = scope.ServiceProvider.GetRequiredService<ApplicationDbContextInitialiser>();
 
-        await initialiser.InitialiseAsync();
+        ;
 
         await initialiser.SeedAsync();

[Timeout] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:23:9
 
         await initialiser.InitialiseAsync();
 
-        await initialiser.SeedAsync();
+        ;
     }
 }

[Timeout] Block removal mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:35:5
     private readonly RoleManager<IdentityRole> _roleManager;
 
-    {
-        _logger = logger;
-        _context = context;
-        _userManager = userManager;
-        _roleManager = roleManager;
-    }
+    {}
 
     public async Task InitialiseAsync()

[Survived] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:46:13
     {
         try
         {
-            await _context.Database.MigrateAsync();
+            ;
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:50:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, "An error occurred while initialising the database.");
+            ;
             throw;
         }

[NoCoverage] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:51:13
         catch (Exception ex)
         {
             _logger.LogError(ex, "An error occurred while initialising the database.");
-            throw;
+            ;
         }
     }

[Survived] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:59:13
     {
         try
         {
-            await TrySeedAsync();
+            ;
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:63:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, "An error occurred while seeding the database.");
+            ;
             throw;
         }

[NoCoverage] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:64:13
         catch (Exception ex)
         {
             _logger.LogError(ex, "An error occurred while seeding the database.");
-            throw;
+            ;
         }
     }

[Killed] Negate expression
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:73:13
         // Default roles
         var administratorRole = new IdentityRole(Roles.Administrator);
 
-        if (_roleManager.Roles.All(r => r.Name != administratorRole.Name))
+        if (!(_roleManager.Roles.All(r => r.Name != administratorRole.Name)))
         {
             await _roleManager.CreateAsync(administratorRole);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Linq method mutation (All() to Any())
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:73:13
         // Default roles
         var administratorRole = new IdentityRole(Roles.Administrator);
 
-        if (_roleManager.Roles.All(r => r.Name != administratorRole.Name))
+        if (_roleManager.Roles.Any(r => r.Name != administratorRole.Name))
         {
             await _roleManager.CreateAsync(administratorRole);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:75:13
 
         if (_roleManager.Roles.All(r => r.Name != administratorRole.Name))
         {
-            await _roleManager.CreateAsync(administratorRole);
+            ;
         }
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Negate expression
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:81:13
         // Default users
         var administrator = new ApplicationUser { UserName = "administrator@localhost", Email = "administrator@localhost" };
 
-        if (_userManager.Users.All(u => u.UserName != administrator.UserName))
+        if (!(_userManager.Users.All(u => u.UserName != administrator.UserName)))
         {
             await _userManager.CreateAsync(administrator, "Administrator1!");

[Survived] Linq method mutation (All() to Any())
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:81:13
         // Default users
         var administrator = new ApplicationUser { UserName = "administrator@localhost", Email = "administrator@localhost" };
 
-        if (_userManager.Users.All(u => u.UserName != administrator.UserName))
+        if (_userManager.Users.Any(u => u.UserName != administrator.UserName))
         {
             await _userManager.CreateAsync(administrator, "Administrator1!");

[Killed] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:83:13
 
         if (_userManager.Users.All(u => u.UserName != administrator.UserName))
         {
-            await _userManager.CreateAsync(administrator, "Administrator1!");
+            ;
             if (!string.IsNullOrWhiteSpace(administratorRole.Name))
             {
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:84:17
         if (_userManager.Users.All(u => u.UserName != administrator.UserName))
         {
             await _userManager.CreateAsync(administrator, "Administrator1!");
-            if (!string.IsNullOrWhiteSpace(administratorRole.Name))
+            if (string.IsNullOrWhiteSpace(administratorRole.Name))
             {
                 await _userManager.AddToRolesAsync(administrator, new [] { administratorRole.Name });

[Survived] Statement mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:86:17
             await _userManager.CreateAsync(administrator, "Administrator1!");
             if (!string.IsNullOrWhiteSpace(administratorRole.Name))
             {
-                await _userManager.AddToRolesAsync(administrator, new [] { administratorRole.Name });
+                ;
             }
         }

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
src/Infrastructure/Data/ApplicationDbContextInitialiser.cs:92:13
 
         // Default data
         // Seed, if necessary
-        if (!_context.TodoLists.Any())
+        if (_context.TodoLists.Any())
         {
             _context.TodoLists.Add(new TodoList
