[Survived] Statement mutation
Infrastructure/Data/Configurations/TodoItemConfiguration.cs:11:9
 {
     public void Configure(EntityTypeBuilder<TodoItem> builder)
     {
-        builder.Property(t => t.Title)
-            .HasMaxLength(200)
-            .IsRequired();
+        ;
     }
 }
