[Killed] Statement mutation
Infrastructure/Data/Configurations/TodoListConfiguration.cs:15:9
             .HasMaxLength(200)
             .IsRequired();
 
-        builder
-            .OwnsOne(b => b.Colour);
+        ;
     }
 }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem
