[Killed] Block removal mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:13:5
     private readonly IMediator _mediator;
 
     public DispatchDomainEventsInterceptor(IMediator mediator)
-    {
-        _mediator = mediator;
-    }
+    {}
 
     public override InterceptionResult<int> SavingChanges(DbContextEventData eventData, InterceptionResult<int> result)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[NoCoverage] Statement mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:19:9
 
     public override InterceptionResult<int> SavingChanges(DbContextEventData eventData, InterceptionResult<int> result)
     {
-        DispatchDomainEvents(eventData.Context).GetAwaiter().GetResult();
+        ;
 
         return base.SavingChanges(eventData, result);

[Timeout] Statement mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:27:9
 
     public override async ValueTask<InterceptionResult<int>> SavingChangesAsync(DbContextEventData eventData, InterceptionResult<int> result, CancellationToken cancellationToken = default)
     {
-        await DispatchDomainEvents(eventData.Context);
+        ;
 
         return await base.SavingChangesAsync(eventData, result, cancellationToken);

[Survived] Equality mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:34:13
 
     public async Task DispatchDomainEvents(DbContext? context)
     {
-        if (context == null) return;
+        if (context != null) return;
 
         var entities = context.ChangeTracker

[NoCoverage] Statement mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:34:30
 
     public async Task DispatchDomainEvents(DbContext? context)
     {
-        if (context == null) return;
+        if (context == null) ;
 
         var entities = context.ChangeTracker

[Survived] Statement mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:45:9
             .SelectMany(e => e.DomainEvents)
             .ToList();
 
-        entities.ToList().ForEach(e => e.ClearDomainEvents());
+        ;
 
         foreach (var domainEvent in domainEvents)

[Survived] Statement mutation
Infrastructure/Data/Interceptors/DispatchDomainEventsInterceptor.cs:48:13
         entities.ToList().ForEach(e => e.ClearDomainEvents());
 
         foreach (var domainEvent in domainEvents)
-            await _mediator.Publish(domainEvent);
+            ;
     }
 }
