[Survived] Boolean mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:189:94
                     Priority = table.Column<int>(type: "int", nullable: false),
                     Reminder = table.Column<DateTime>(type: "datetime2", nullable: true),
                     Done = table.Column<bool>(type: "bit", nullable: false),
-                    Created = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),
+                    Created = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: true),
                     CreatedBy = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     LastModified = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: false),

[Survived] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:196:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_TodoItems", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_TodoItems_TodoLists_ListId",

[Survived] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:197:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_TodoItems", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_TodoItems_TodoLists_ListId",
-                        column: x => x.ListId,
-                        principalTable: "TodoLists",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[Survived] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:210:13
                 table: "AspNetRoleClaims",
                 column: "RoleId");
 
-            migrationBuilder.CreateIndex(
-                name: "RoleNameIndex",
-                table: "AspNetRoles",
-                column: "NormalizedName",
-                unique: true,
-                filter: "[NormalizedName] IS NOT NULL");
+            ;
 
             migrationBuilder.CreateIndex(

[Survived] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:237:13
                 table: "AspNetUsers",
                 column: "NormalizedEmail");
 
-            migrationBuilder.CreateIndex(
-                name: "UserNameIndex",
-                table: "AspNetUsers",
-                column: "NormalizedUserName",
-                unique: true,
-                filter: "[NormalizedUserName] IS NOT NULL");
+            ;
 
             migrationBuilder.CreateIndex(

[Survived] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:244:13
                 unique: true,
                 filter: "[NormalizedUserName] IS NOT NULL");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_TodoItems_ListId",
-                table: "TodoItems",
-                column: "ListId");
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:268:13
             migrationBuilder.DropTable(
                 name: "AspNetUserTokens");
 
-            migrationBuilder.DropTable(
-                name: "TodoItems");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/00000000000000_InitialCreate.cs:277:13
             migrationBuilder.DropTable(
                 name: "AspNetUsers");
 
-            migrationBuilder.DropTable(
-                name: "TodoLists");
+            ;
         }
     }
