[NoCoverage] Negate expression
src/Infrastructure/Identity/IdentityResultExtensions.cs:10:16
 {
     public static Result ToApplicationResult(this IdentityResult result)
     {
-        return result.Succeeded
+        return !(result.Succeeded
+)
             ? Result.Success()
             : Result.Failure(result.Errors.Select(e => e.Description));
