[Timeout] Statement mutation
src/Domain/Common/BaseEntity.cs:18:9
 
     public void AddDomainEvent(BaseEvent domainEvent)
     {
-        _domainEvents.Add(domainEvent);
+        ;
     }
 

[NoCoverage] Statement mutation
src/Domain/Common/BaseEntity.cs:23:9
 
     public void RemoveDomainEvent(BaseEvent domainEvent)
     {
-        _domainEvents.Remove(domainEvent);
+        ;
     }
 

[Survived] Statement mutation
src/Domain/Common/BaseEntity.cs:28:9
 
     public void ClearDomainEvents()
     {
-        _domainEvents.Clear();
+        ;
     }
 }
