[NoCoverage] Logical mutation
src/Domain/Common/ValueObject.cs:8:13
 {
     protected static bool EqualOperator(ValueObject left, ValueObject right)
     {
-        if (left is null ^ right is null)
+        if (left is null == right is null)
         {
             return false;

[NoCoverage] Negate expression
src/Domain/Common/ValueObject.cs:8:13
 {
     protected static bool EqualOperator(ValueObject left, ValueObject right)
     {
-        if (left is null ^ right is null)
+        if (!(left is null ^ right is null))
         {
             return false;

[NoCoverage] Boolean mutation
src/Domain/Common/ValueObject.cs:13:40
             return false;
         }
 
-        return left?.Equals(right!) != false;
+        return left?.Equals(right!) != true;
     }
 

[NoCoverage] Equality mutation
src/Domain/Common/ValueObject.cs:13:16
             return false;
         }
 
-        return left?.Equals(right!) != false;
+        return left?.Equals(right!) == false;
     }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Domain/Common/ValueObject.cs:18:16
 
     protected static bool NotEqualOperator(ValueObject left, ValueObject right)
     {
-        return !(EqualOperator(left, right));
+        return (EqualOperator(left, right));
     }
 

[Killed] Equality mutation
src/Domain/Common/ValueObject.cs:25:28
 
     public override bool Equals(object? obj)
     {
-        if (obj == null || obj.GetType() != GetType())
+        if (obj == null || obj.GetType() == GetType())
         {
             return false;
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldReturnCorrectColourCode

[Killed] Equality mutation
src/Domain/Common/ValueObject.cs:25:13
 
     public override bool Equals(object? obj)
     {
-        if (obj == null || obj.GetType() != GetType())
+        if (obj != null || obj.GetType() != GetType())
         {
             return false;
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldReturnCorrectColourCode

[NoCoverage] Equality mutation
src/Domain/Common/ValueObject.cs:37:26
     public override int GetHashCode()
     {
         return GetEqualityComponents()
-            .Select(x => x != null ? x.GetHashCode() : 0)
+            .Select(x => x == null ? x.GetHashCode() : 0)
             .Aggregate((x, y) => x ^ y);
     }
