[Survived] Negate expression
src/Domain/Entities/TodoItem.cs:21:17
         get => _done;
         set
         {
-            if (value && !_done)
+            if (!(value && !_done))
             {
                 AddDomainEvent(new TodoItemCompletedEvent(this));

[Survived] Logical mutation
src/Domain/Entities/TodoItem.cs:21:17
         get => _done;
         set
         {
-            if (value && !_done)
+            if (value || !_done)
             {
                 AddDomainEvent(new TodoItemCompletedEvent(this));

[Survived] Statement mutation
src/Domain/Entities/TodoItem.cs:23:17
         {
             if (value && !_done)
             {
-                AddDomainEvent(new TodoItemCompletedEvent(this));
+                ;
             }
 
