[Survived] Block removal mutation
src/Domain/Events/TodoItemCompletedEvent.cs:6:5
 public class TodoItemCompletedEvent : BaseEvent
 {
     public TodoItemCompletedEvent(TodoItem item)
-    {
-        Item = item;
-    }
+    {}
 
     public TodoItem Item { get; }
