[Survived] Block removal mutation
src/Domain/Events/TodoItemCreatedEvent.cs:6:5
 public class TodoItemCreatedEvent : BaseEvent
 {
     public TodoItemCreatedEvent(TodoItem item)
-    {
-        Item = item;
-    }
+    {}
 
     public TodoItem Item { get; }
