[Survived] Block removal mutation
src/Domain/Events/TodoItemDeletedEvent.cs:6:5
 public class TodoItemDeletedEvent : BaseEvent
 {
     public TodoItemDeletedEvent(TodoItem item)
-    {
-        Item = item;
-    }
+    {}
 
     public TodoItem Item { get; }
