[Killed] Block removal mutation
src/Domain/ValueObjects/Colour.cs:14:5
     }
 
     private Colour(string code)
-    {
-        Code = code;
-    }
+    {}
 
     public static Colour From(string code)
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformImplicitConversionToColourCodeString; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldReturnCorrectColourCode

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Domain/ValueObjects/Colour.cs:22:13
     {
         var colour = new Colour { Code = code };
 
-        if (!SupportedColours.Contains(colour))
+        if (SupportedColours.Contains(colour))
         {
             throw new UnsupportedColourException(code);
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldReturnCorrectColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldThrowUnsupportedColourExceptionGivenNotSupportedColourCode

[Killed] Statement mutation
src/Domain/ValueObjects/Colour.cs:24:13
 
         if (!SupportedColours.Contains(colour))
         {
-            throw new UnsupportedColourException(code);
+            ;
         }
 
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldThrowUnsupportedColourExceptionGivenNotSupportedColourCode

[Killed] Block removal mutation
src/Domain/ValueObjects/Colour.cs:49:5
     public string Code { get; private set; } = "#000000";
 
     public static implicit operator string(Colour colour)
-    {
-        return colour.ToString();
-    }
+    {}
 
     public static explicit operator Colour(string code)
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformImplicitConversionToColourCodeString

[Killed] Block removal mutation
src/Domain/ValueObjects/Colour.cs:54:5
     }
 
     public static explicit operator Colour(string code)
-    {
-        return From(code);
-    }
+    {}
 
     public override string ToString()
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode

[Killed] Block removal mutation
src/Domain/ValueObjects/Colour.cs:59:5
     }
 
     public override string ToString()
-    {
-        return Code;
-    }
+    {}
 
     protected static IEnumerable<Colour> SupportedColours
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformImplicitConversionToColourCodeString; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ToStringReturnsCode

[Killed] Statement mutation
src/Domain/ValueObjects/Colour.cs:67:13
     {
         get
         {
-            yield return White;
+            ;
             yield return Red;
             yield return Orange;
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldPerformExplicitConversionGivenSupportedColourCode; CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldReturnCorrectColourCode

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:68:13
         get
         {
             yield return White;
-            yield return Red;
+            ;
             yield return Orange;
             yield return Yellow;

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:69:13
         {
             yield return White;
             yield return Red;
-            yield return Orange;
+            ;
             yield return Yellow;
             yield return Green;

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:70:13
             yield return White;
             yield return Red;
             yield return Orange;
-            yield return Yellow;
+            ;
             yield return Green;
             yield return Blue;

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:71:13
             yield return Red;
             yield return Orange;
             yield return Yellow;
-            yield return Green;
+            ;
             yield return Blue;
             yield return Purple;

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:72:13
             yield return Orange;
             yield return Yellow;
             yield return Green;
-            yield return Blue;
+            ;
             yield return Purple;
             yield return Grey;

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:73:13
             yield return Yellow;
             yield return Green;
             yield return Blue;
-            yield return Purple;
+            ;
             yield return Grey;
         }

[Survived] Statement mutation
src/Domain/ValueObjects/Colour.cs:74:13
             yield return Green;
             yield return Blue;
             yield return Purple;
-            yield return Grey;
+            ;
         }
     }

[Killed] Statement mutation
src/Domain/ValueObjects/Colour.cs:80:9
 
     protected override IEnumerable<object> GetEqualityComponents()
     {
-        yield return Code;
+        ;
     }
 }
killedBy: CA.Mutation.Domain.UnitTests.ValueObjects.ColourTests.ShouldThrowUnsupportedColourExceptionGivenNotSupportedColourCode
