[Killed] Block removal mutation
Application/Common/Behaviours/LoggingBehaviour.cs:14:5
     private readonly IIdentityService _identityService;
 
     public LoggingBehaviour(ILogger<TRequest> logger, IUser user, IIdentityService identityService)
-    {
-        _logger = logger;
-        _user = user;
-        _identityService = identityService;
-    }
+    {}
 
     public async Task Process(TRequest request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldCallGetUserNameAsyncOnceIfAuthenticated; CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldNotCallGetUserNameAsyncOnceIfUnauthenticated

[Killed] Null coalescing mutation (left to right)
Application/Common/Behaviours/LoggingBehaviour.cs:23:22
     public async Task Process(TRequest request, CancellationToken cancellationToken)
     {
         var requestName = typeof(TRequest).Name;
-        var userId = _user.Id ?? string.Empty;
+        var userId = string.Empty ?? _user.Id;
         string? userName = string.Empty;
 
killedBy: CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldCallGetUserNameAsyncOnceIfAuthenticated

[Killed] Null coalescing mutation (remove right)
Application/Common/Behaviours/LoggingBehaviour.cs:23:22
     public async Task Process(TRequest request, CancellationToken cancellationToken)
     {
         var requestName = typeof(TRequest).Name;
-        var userId = _user.Id ?? string.Empty;
+        var userId = string.Empty;
         string? userName = string.Empty;
 
killedBy: CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldCallGetUserNameAsyncOnceIfAuthenticated

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Application/Common/Behaviours/LoggingBehaviour.cs:26:13
         var userId = _user.Id ?? string.Empty;
         string? userName = string.Empty;
 
-        if (!string.IsNullOrEmpty(userId))
+        if (string.IsNullOrEmpty(userId))
         {
             userName = await _identityService.GetUserNameAsync(userId);
killedBy: CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldCallGetUserNameAsyncOnceIfAuthenticated; CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldNotCallGetUserNameAsyncOnceIfUnauthenticated

[Killed] Block removal mutation
Application/Common/Behaviours/LoggingBehaviour.cs:27:9
         string? userName = string.Empty;
 
         if (!string.IsNullOrEmpty(userId))
-        {
-            userName = await _identityService.GetUserNameAsync(userId);
-        }
+        {}
 
         _logger.LogInformation("CA.Mutation Request: {Name} {@UserId} {@UserName} {@Request}",
killedBy: CA.Mutation.Application.UnitTests.Common.Behaviours.RequestLoggerTests.ShouldCallGetUserNameAsyncOnceIfAuthenticated
