[Killed] Block removal mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:18:5
         ILogger<TRequest> logger,
         IUser user,
         IIdentityService identityService)
-    {
-        _timer = new Stopwatch();
-
-        _logger = logger;
-        _user = user;
-        _identityService = identityService;
-    }
+    {}
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldRequireValidTodoItemId

[Timeout] Statement mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:28:9
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
     {
-        _timer.Start();
+        ;
 
         var response = await next();

[Timeout] Statement mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:32:9
 
         var response = await next();
 
-        _timer.Stop();
+        ;
 
         var elapsedMilliseconds = _timer.ElapsedMilliseconds;

[Timeout] Equality mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:36:13
 
         var elapsedMilliseconds = _timer.ElapsedMilliseconds;
 
-        if (elapsedMilliseconds > 500)
+        if (elapsedMilliseconds < 500)
         {
             var requestName = typeof(TRequest).Name;

[Timeout] Equality mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:36:13
 
         var elapsedMilliseconds = _timer.ElapsedMilliseconds;
 
-        if (elapsedMilliseconds > 500)
+        if (elapsedMilliseconds >= 500)
         {
             var requestName = typeof(TRequest).Name;

[NoCoverage] Null coalescing mutation (remove left)
Application/Common/Behaviours/PerformanceBehaviour.cs:39:26
         if (elapsedMilliseconds > 500)
         {
             var requestName = typeof(TRequest).Name;
-            var userId = _user.Id ?? string.Empty;
+            var userId = _user.Id;
             var userName = string.Empty;
 

[NoCoverage] Statement mutation
Application/Common/Behaviours/PerformanceBehaviour.cs:47:13
                 userName = await _identityService.GetUserNameAsync(userId);
             }
 
-            _logger.LogWarning("CA.Mutation Long Running Request: {Name} ({ElapsedMilliseconds} milliseconds) {@UserId} {@UserName} {@Request}",
-                requestName, elapsedMilliseconds, userId, userName, request);
+            ;
         }
 
