[Timeout] Block removal mutation
Application/Common/Behaviours/UnhandledExceptionBehaviour.cs:10:5
     private readonly ILogger<TRequest> _logger;
 
     public UnhandledExceptionBehaviour(ILogger<TRequest> logger)
-    {
-        _logger = logger;
-    }
+    {}
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/Common/Behaviours/UnhandledExceptionBehaviour.cs:17:9
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
     {
         try
-        {
-            return await next();
-        }
+        {}
         catch (Exception ex)
         {
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldRequireValidTodoItemId

[Timeout] Statement mutation
Application/Common/Behaviours/UnhandledExceptionBehaviour.cs:24:13
         {
             var requestName = typeof(TRequest).Name;
 
-            _logger.LogError(ex, "CA.Mutation Request: Unhandled Exception for Request {Name} {@Request}", requestName, request);
+            ;
 
             throw;

[Timeout] Statement mutation
Application/Common/Behaviours/UnhandledExceptionBehaviour.cs:26:13
 
             _logger.LogError(ex, "CA.Mutation Request: Unhandled Exception for Request {Name} {@Request}", requestName, request);
 
-            throw;
+            ;
         }
     }
