[Killed] Block removal mutation
Application/Common/Behaviours/ValidationBehaviour.cs:11:5
     private readonly IEnumerable<IValidator<TRequest>> _validators;
 
     public ValidationBehaviour(IEnumerable<IValidator<TRequest>> validators)
-    {
-        _validators = validators;
-    }
+    {}
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Timeout] Negate expression
Application/Common/Behaviours/ValidationBehaviour.cs:17:13
 
     public async Task<TResponse> Handle(TRequest request, RequestHandlerDelegate<TResponse> next, CancellationToken cancellationToken)
     {
-        if (_validators.Any())
+        if (!(_validators.Any()))
         {
             var context = new ValidationContext<TRequest>(request);

[Killed] Negate expression
Application/Common/Behaviours/ValidationBehaviour.cs:30:17
                 .SelectMany(r => r.Errors)
                 .ToList();
 
-            if (failures.Any())
+            if (!(failures.Any()))
                 throw new ValidationException(failures);
         }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Killed] Statement mutation
Application/Common/Behaviours/ValidationBehaviour.cs:31:17
                 .ToList();
 
             if (failures.Any())
-                throw new ValidationException(failures);
+                ;
         }
         return await next();
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields
