[Killed] Block removal mutation
Application/Common/Exceptions/ValidationException.cs:9:5
 {
     public ValidationException()
         : base("One or more validation failures have occurred.")
-    {
-        Errors = new Dictionary<string, string[]>();
-    }
+    {}
 
     public ValidationException(IEnumerable<ValidationFailure> failures)
killedBy: CA.Mutation.Application.UnitTests.Common.Exceptions.ValidationExceptionTests.DefaultConstructorCreatesAnEmptyErrorDictionary

[Timeout] Block removal mutation
Application/Common/Exceptions/ValidationException.cs:15:5
 
     public ValidationException(IEnumerable<ValidationFailure> failures)
         : this()
-    {
-        Errors = failures
-            .GroupBy(e => e.PropertyName, e => e.ErrorMessage)
-            .ToDictionary(failureGroup => failureGroup.Key, failureGroup => failureGroup.ToArray());
-    }
+    {}
 
     public IDictionary<string, string[]> Errors { get; }
