[Killed] Statement mutation
Application/Common/Models/LookupDto.cs:15:13
     {
         public Mapping()
         {
-            CreateMap<TodoList, LookupDto>();
+            ;
             CreateMap<TodoItem, LookupDto>();
         }
killedBy: CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldSupportMappingFromSourceToDestination(CA.Mutation.Domain.Entities.TodoList,CA.Mutation.Application.Common.Models.LookupDto)

[Killed] Statement mutation
Application/Common/Models/LookupDto.cs:16:13
         public Mapping()
         {
             CreateMap<TodoList, LookupDto>();
-            CreateMap<TodoItem, LookupDto>();
+            ;
         }
     }
killedBy: CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldSupportMappingFromSourceToDestination(CA.Mutation.Domain.Entities.TodoItem,CA.Mutation.Application.Common.Models.LookupDto)
