[NoCoverage] Math method mutation (Ceiling() to Floor())
Application/Common/Models/PaginatedList.cs:13:27
     public PaginatedList(IReadOnlyCollection<T> items, int count, int pageNumber, int pageSize)
     {
         PageNumber = pageNumber;
-        TotalPages = (int)Math.Ceiling(count / (double)pageSize);
+        TotalPages = (int)Math.Floor(count / (double)pageSize);
         TotalCount = count;
         Items = items;

[NoCoverage] Arithmetic mutation
Application/Common/Models/PaginatedList.cs:13:40
     public PaginatedList(IReadOnlyCollection<T> items, int count, int pageNumber, int pageSize)
     {
         PageNumber = pageNumber;
-        TotalPages = (int)Math.Ceiling(count / (double)pageSize);
+        TotalPages = (int)Math.Ceiling(count * (double)pageSize);
         TotalCount = count;
         Items = items;

[NoCoverage] Equality mutation
Application/Common/Models/PaginatedList.cs:18:36
         Items = items;
     }
 
-    public bool HasPreviousPage => PageNumber > 1;
+    public bool HasPreviousPage => PageNumber >= 1;
 
     public bool HasNextPage => PageNumber < TotalPages;

[NoCoverage] Equality mutation
Application/Common/Models/PaginatedList.cs:18:36
         Items = items;
     }
 
-    public bool HasPreviousPage => PageNumber > 1;
+    public bool HasPreviousPage => PageNumber < 1;
 
     public bool HasNextPage => PageNumber < TotalPages;

[NoCoverage] Equality mutation
Application/Common/Models/PaginatedList.cs:20:32
 
     public bool HasPreviousPage => PageNumber > 1;
 
-    public bool HasNextPage => PageNumber < TotalPages;
+    public bool HasNextPage => PageNumber > TotalPages;
 
     public static async Task<PaginatedList<T>> CreateAsync(IQueryable<T> source, int pageNumber, int pageSize)

[NoCoverage] Equality mutation
Application/Common/Models/PaginatedList.cs:20:32
 
     public bool HasPreviousPage => PageNumber > 1;
 
-    public bool HasNextPage => PageNumber < TotalPages;
+    public bool HasNextPage => PageNumber <= TotalPages;
 
     public static async Task<PaginatedList<T>> CreateAsync(IQueryable<T> source, int pageNumber, int pageSize)

[NoCoverage] Linq method mutation (Take() to Skip())
Application/Common/Models/PaginatedList.cs:25:27
     public static async Task<PaginatedList<T>> CreateAsync(IQueryable<T> source, int pageNumber, int pageSize)
     {
         var count = await source.CountAsync();
-        var items = await source.Skip((pageNumber - 1) * pageSize).Take(pageSize).ToListAsync();
+        var items = await source.Skip((pageNumber - 1) * pageSize).Skip(pageSize).ToListAsync();
 
         return new PaginatedList<T>(items, count, pageNumber, pageSize);

[NoCoverage] Arithmetic mutation
Application/Common/Models/PaginatedList.cs:25:39
     public static async Task<PaginatedList<T>> CreateAsync(IQueryable<T> source, int pageNumber, int pageSize)
     {
         var count = await source.CountAsync();
-        var items = await source.Skip((pageNumber - 1) * pageSize).Take(pageSize).ToListAsync();
+        var items = await source.Skip((pageNumber - 1) / pageSize).Take(pageSize).ToListAsync();
 
         return new PaginatedList<T>(items, count, pageNumber, pageSize);
