[NoCoverage] Block removal mutation
Application/Common/Models/Result.cs:6:5
 public class Result
 {
     internal Result(bool succeeded, IEnumerable<string> errors)
-    {
-        Succeeded = succeeded;
-        Errors = errors.ToArray();
-    }
+    {}
 
     public bool Succeeded { get; init; }

[NoCoverage] Block removal mutation
Application/Common/Models/Result.cs:16:5
     public string[] Errors { get; init; }
 
     public static Result Success()
-    {
-        return new Result(true, Array.Empty<string>());
-    }
+    {}
 
     public static Result Failure(IEnumerable<string> errors)

[NoCoverage] Block removal mutation
Application/Common/Models/Result.cs:21:5
     }
 
     public static Result Failure(IEnumerable<string> errors)
-    {
-        return new Result(false, errors);
-    }
+    {}
 }
 
