[Killed] Block removal mutation
TodoItems/Commands/CreateTodoItem/CreateTodoItem.cs:19:5
     private readonly IApplicationDbContext _context;
 
     public CreateTodoItemCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task<int> Handle(CreateTodoItemCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[Survived] Statement mutation
TodoItems/Commands/CreateTodoItem/CreateTodoItem.cs:32:9
             Done = false
         };
 
-        entity.AddDomainEvent(new TodoItemCreatedEvent(entity));
+        ;
 
         _context.TodoItems.Add(entity);

[Killed] Statement mutation
TodoItems/Commands/CreateTodoItem/CreateTodoItem.cs:34:9
 
         entity.AddDomainEvent(new TodoItemCreatedEvent(entity));
 
-        _context.TodoItems.Add(entity);
+        ;
 
         await _context.SaveChangesAsync(cancellationToken);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[Killed] Statement mutation
TodoItems/Commands/CreateTodoItem/CreateTodoItem.cs:36:9
 
         _context.TodoItems.Add(entity);
 
-        await _context.SaveChangesAsync(cancellationToken);
+        ;
 
         return entity.Id;
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem
