[Killed] Statement mutation
TodoItems/Commands/CreateTodoItem/CreateTodoItemCommandValidator.cs:7:9
 {
     public CreateTodoItemCommandValidator()
     {
-        RuleFor(v => v.Title)
-            .MaximumLength(200)
-            .NotEmpty();
+        ;
     }
 }
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldRequireMinimumFields
