[Killed] Block removal mutation
TodoItems/Commands/DeleteTodoItem/DeleteTodoItem.cs:13:5
     private readonly IApplicationDbContext _context;
 
     public DeleteTodoItemCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(DeleteTodoItemCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldRequireValidTodoItemId

[Killed] Statement mutation
TodoItems/Commands/DeleteTodoItem/DeleteTodoItem.cs:22:9
         var entity = await _context.TodoItems
             .FindAsync(new object[] { request.Id }, cancellationToken);
 
-        Guard.Against.NotFound(request.Id, entity);
+        ;
 
         _context.TodoItems.Remove(entity);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldRequireValidTodoItemId

[Killed] Statement mutation
TodoItems/Commands/DeleteTodoItem/DeleteTodoItem.cs:24:9
 
         Guard.Against.NotFound(request.Id, entity);
 
-        _context.TodoItems.Remove(entity);
+        ;
 
         entity.AddDomainEvent(new TodoItemDeletedEvent(entity));
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem

[Survived] Statement mutation
TodoItems/Commands/DeleteTodoItem/DeleteTodoItem.cs:26:9
 
         _context.TodoItems.Remove(entity);
 
-        entity.AddDomainEvent(new TodoItemDeletedEvent(entity));
+        ;
 
         await _context.SaveChangesAsync(cancellationToken);
