[Killed] Block removal mutation
TodoItems/Commands/UpdateTodoItemDetail/UpdateTodoItemDetail.cs:22:5
     private readonly IApplicationDbContext _context;
 
     public UpdateTodoItemDetailCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(UpdateTodoItemDetailCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem
