[Killed] Block removal mutation
TodoItems/Commands/UpdateTodoItem/UpdateTodoItem.cs:19:5
     private readonly IApplicationDbContext _context;
 
     public UpdateTodoItemCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(UpdateTodoItemCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldRequireValidTodoItemId; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemTests.ShouldRequireValidTodoItemId; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemTests.ShouldUpdateTodoItem

[Killed] Array initializer mutation
TodoItems/Commands/UpdateTodoItem/UpdateTodoItem.cs:26:24
     public async Task Handle(UpdateTodoItemCommand request, CancellationToken cancellationToken)
     {
         var entity = await _context.TodoItems
-            .FindAsync(new object[] { request.Id }, cancellationToken);
+            .FindAsync(new object[] {}, cancellationToken);
 
         Guard.Against.NotFound(request.Id, entity);
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldRequireValidTodoItemId; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemTests.ShouldRequireValidTodoItemId; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemTests.ShouldUpdateTodoItem
