[Killed] Block removal mutation
Application/TodoItems/EventHandlers/TodoItemCompletedEventHandler.cs:11:5
     private readonly ILogger<TodoItemCompletedEventHandler> _logger;
 
     public TodoItemCompletedEventHandler(ILogger<TodoItemCompletedEventHandler> logger)
-    {
-        _logger = logger;
-    }
+    {}
 
     public Task Handle(TodoItemCompletedEvent notification, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnAllListsAndItems

[Timeout] Block removal mutation
Application/TodoItems/EventHandlers/TodoItemCompletedEventHandler.cs:16:5
     }
 
     public Task Handle(TodoItemCompletedEvent notification, CancellationToken cancellationToken)
-    {
-        _logger.LogInformation("CA.Mutation Domain Event: {DomainEvent}", notification.GetType().Name);
-
-        return Task.CompletedTask;
-    }
+    {}
 }
 
