[Timeout] Block removal mutation
Application/TodoItems/EventHandlers/TodoItemCreatedEventHandler.cs:11:5
     private readonly ILogger<TodoItemCreatedEventHandler> _logger;
 
     public TodoItemCreatedEventHandler(ILogger<TodoItemCreatedEventHandler> logger)
-    {
-        _logger = logger;
-    }
+    {}
 
     public Task Handle(TodoItemCreatedEvent notification, CancellationToken cancellationToken)

[Killed] Block removal mutation
Application/TodoItems/EventHandlers/TodoItemCreatedEventHandler.cs:16:5
     }
 
     public Task Handle(TodoItemCreatedEvent notification, CancellationToken cancellationToken)
-    {
-        _logger.LogInformation("CA.Mutation Domain Event: {DomainEvent}", notification.GetType().Name);
-
-        return Task.CompletedTask;
-    }
+    {}
 }
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem
