[NoCoverage] Block removal mutation
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPagination.cs:20:5
     private readonly IMapper _mapper;
 
     public GetTodoItemsWithPaginationQueryHandler(IApplicationDbContext context, IMapper mapper)
-    {
-        _context = context;
-        _mapper = mapper;
-    }
+    {}
 
     public async Task<PaginatedList<TodoItemBriefDto>> Handle(GetTodoItemsWithPaginationQuery request, CancellationToken cancellationToken)

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPagination.cs:27:22
 
     public async Task<PaginatedList<TodoItemBriefDto>> Handle(GetTodoItemsWithPaginationQuery request, CancellationToken cancellationToken)
     {
-        return await _context.TodoItems
-            .Where(x => x.ListId == request.ListId)
-            .OrderBy(x => x.Title)
-            .ProjectTo<TodoItemBriefDto>(_mapper.ConfigurationProvider)
-            .PaginatedListAsync(request.PageNumber, request.PageSize);
+        return await _context.TodoItems
+            .Where(x => x.ListId == request.ListId)
+            .OrderByDescending(x => x.Title)
+            .ProjectTo<TodoItemBriefDto>(_mapper.ConfigurationProvider)
+            .PaginatedListAsync(request.PageNumber, request.PageSize);
     }
 }

[NoCoverage] Equality mutation
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPagination.cs:28:25
     public async Task<PaginatedList<TodoItemBriefDto>> Handle(GetTodoItemsWithPaginationQuery request, CancellationToken cancellationToken)
     {
         return await _context.TodoItems
-            .Where(x => x.ListId == request.ListId)
+            .Where(x => x.ListId != request.ListId)
             .OrderBy(x => x.Title)
             .ProjectTo<TodoItemBriefDto>(_mapper.ConfigurationProvider)
