[NoCoverage] Statement mutation
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPaginationQueryValidator.cs:7:9
 {
     public GetTodoItemsWithPaginationQueryValidator()
     {
-        RuleFor(x => x.ListId)
-            .NotEmpty().WithMessage("ListId is required.");
+        ;
 
         RuleFor(x => x.PageNumber)

[NoCoverage] Statement mutation
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPaginationQueryValidator.cs:10:9
         RuleFor(x => x.ListId)
             .NotEmpty().WithMessage("ListId is required.");
 
-        RuleFor(x => x.PageNumber)
-            .GreaterThanOrEqualTo(1).WithMessage("PageNumber at least greater than or equal to 1.");
+        ;
 
         RuleFor(x => x.PageSize)

[NoCoverage] Statement mutation
TodoItems/Queries/GetTodoItemsWithPagination/GetTodoItemsWithPaginationQueryValidator.cs:13:9
         RuleFor(x => x.PageNumber)
             .GreaterThanOrEqualTo(1).WithMessage("PageNumber at least greater than or equal to 1.");
 
-        RuleFor(x => x.PageSize)
-            .GreaterThanOrEqualTo(1).WithMessage("PageSize at least greater than or equal to 1.");
+        ;
     }
 }
