[Killed] Statement mutation
TodoItems/Queries/GetTodoItemsWithPagination/TodoItemBriefDto.cs:19:13
     {
         public Mapping()
         {
-            CreateMap<TodoItem, TodoItemBriefDto>();
+            ;
         }
     }
killedBy: CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldSupportMappingFromSourceToDestination(CA.Mutation.Domain.Entities.TodoItem,CA.Mutation.Application.TodoItems.Queries.GetTodoItemsWi
