[Killed] Block removal mutation
TodoLists/Commands/CreateTodoList/CreateTodoList.cs:16:5
     private readonly IApplicationDbContext _context;
 
     public CreateTodoListCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task<int> Handle(CreateTodoListCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoItems.Commands.CreateTodoItemTests.ShouldCreateTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.DeleteTodoItemTests.ShouldDeleteTodoItem; CA.Mutation.Application.FunctionalTests.TodoItems.Commands.UpdateTodoItemDetailTests.ShouldUpdateTodoItem

[Timeout] Statement mutation
TodoLists/Commands/CreateTodoList/CreateTodoList.cs:26:9
 
         entity.Title = request.Title;
 
-        _context.TodoLists.Add(entity);
+        ;
 
         await _context.SaveChangesAsync(cancellationToken);
