[Timeout] Statement mutation
TodoLists/Commands/CreateTodoList/CreateTodoListCommandValidator.cs:13:9
     {
         _context = context;
 
-        RuleFor(v => v.Title)
-            .NotEmpty()
-            .MaximumLength(200)
-            .MustAsync(BeUniqueTitle)
-                .WithMessage("'{PropertyName}' must be unique.")
-                .WithErrorCode("Unique");
+        ;
     }
 

[Timeout] Equality mutation
TodoLists/Commands/CreateTodoList/CreateTodoListCommandValidator.cs:24:28
     public async Task<bool> BeUniqueTitle(string title, CancellationToken cancellationToken)
     {
         return await _context.TodoLists
-            .AllAsync(l => l.Title != title, cancellationToken);
+            .AllAsync(l => l.Title == title, cancellationToken);
     }
 }
