[Killed] Block removal mutation
TodoLists/Commands/DeleteTodoList/DeleteTodoList.cs:12:5
     private readonly IApplicationDbContext _context;
 
     public DeleteTodoListCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(DeleteTodoListCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.DeleteTodoListTests.ShouldDeleteTodoList; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.DeleteTodoListTests.ShouldRequireValidTodoListId

[Killed] Equality mutation
TodoLists/Commands/DeleteTodoList/DeleteTodoList.cs:19:25
     public async Task Handle(DeleteTodoListCommand request, CancellationToken cancellationToken)
     {
         var entity = await _context.TodoLists
-            .Where(l => l.Id == request.Id)
+            .Where(l => l.Id != request.Id)
             .SingleOrDefaultAsync(cancellationToken);
 
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.DeleteTodoListTests.ShouldDeleteTodoList

[Killed] Statement mutation
TodoLists/Commands/DeleteTodoList/DeleteTodoList.cs:24:9
 
         Guard.Against.NotFound(request.Id, entity);
 
-        _context.TodoLists.Remove(entity);
+        ;
 
         await _context.SaveChangesAsync(cancellationToken);
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.DeleteTodoListTests.ShouldDeleteTodoList
