[Killed] Block removal mutation
TodoLists/Commands/PurgeTodoLists/PurgeTodoLists.cs:16:5
     private readonly IApplicationDbContext _context;
 
     public PurgeTodoListsCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(PurgeTodoListsCommand request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists

[Killed] Statement mutation
TodoLists/Commands/PurgeTodoLists/PurgeTodoLists.cs:22:9
 
     public async Task Handle(PurgeTodoListsCommand request, CancellationToken cancellationToken)
     {
-        _context.TodoLists.RemoveRange(_context.TodoLists);
+        ;
 
         await _context.SaveChangesAsync(cancellationToken);
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.PurgeTodoListsTests.ShouldDeleteAllLists
