[Timeout] Block removal mutation
TodoLists/Commands/UpdateTodoList/UpdateTodoList.cs:17:5
     private readonly IApplicationDbContext _context;
 
     public UpdateTodoListCommandHandler(IApplicationDbContext context)
-    {
-        _context = context;
-    }
+    {}
 
     public async Task Handle(UpdateTodoListCommand request, CancellationToken cancellationToken)

[Killed] Array initializer mutation
TodoLists/Commands/UpdateTodoList/UpdateTodoList.cs:24:24
     public async Task Handle(UpdateTodoListCommand request, CancellationToken cancellationToken)
     {
         var entity = await _context.TodoLists
-            .FindAsync(new object[] { request.Id }, cancellationToken);
+            .FindAsync(new object[] {}, cancellationToken);
 
         Guard.Against.NotFound(request.Id, entity);
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.UpdateTodoListTests.ShouldRequireValidTodoListId; CA.Mutation.Application.FunctionalTests.TodoLists.Commands.UpdateTodoListTests.ShouldUpdateTodoList
