[Killed] Equality mutation
TodoLists/Commands/UpdateTodoList/UpdateTodoListCommandValidator.cs:24:25
     public async Task<bool> BeUniqueTitle(UpdateTodoListCommand model, string title, CancellationToken cancellationToken)
     {
         return await _context.TodoLists
-            .Where(l => l.Id != model.Id)
+            .Where(l => l.Id == model.Id)
             .AllAsync(l => l.Title != title, cancellationToken);
     }
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.UpdateTodoListTests.ShouldRequireUniqueTitle

[Killed] Equality mutation
TodoLists/Commands/UpdateTodoList/UpdateTodoListCommandValidator.cs:25:28
     {
         return await _context.TodoLists
             .Where(l => l.Id != model.Id)
-            .AllAsync(l => l.Title != title, cancellationToken);
+            .AllAsync(l => l.Title == title, cancellationToken);
     }
 }
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Commands.UpdateTodoListTests.ShouldRequireUniqueTitle
