[Killed] Block removal mutation
TodoLists/Queries/GetTodos/GetTodos.cs:17:5
     private readonly IMapper _mapper;
 
     public GetTodosQueryHandler(IApplicationDbContext context, IMapper mapper)
-    {
-        _context = context;
-        _mapper = mapper;
-    }
+    {}
 
     public async Task<TodosVm> Handle(GetTodosQuery request, CancellationToken cancellationToken)
killedBy: CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnAllListsAndItems; CA.Mutation.Application.FunctionalTests.TodoLists.Queries.GetTodosTests.ShouldReturnPriorityLevels

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
TodoLists/Queries/GetTodos/GetTodos.cs:31:27
                 .Select(p => new LookupDto { Id = (int)p, Title = p.ToString() })
                 .ToList(),
 
-            Lists = await _context.TodoLists
-                .AsNoTracking()
-                .ProjectTo<TodoListDto>(_mapper.ConfigurationProvider)
-                .OrderBy(t => t.Title)
-                .ToListAsync(cancellationToken)
+            Lists = await _context.TodoLists
+                .AsNoTracking()
+                .ProjectTo<TodoListDto>(_mapper.ConfigurationProvider)
+                .OrderByDescending(t => t.Title)
+                .ToListAsync(cancellationToken)
         };
     }
