[Killed] Statement mutation
TodoLists/Queries/GetTodos/TodoItemDto.cs:23:13
     {
         public Mapping()
         {
-            CreateMap<TodoItem, TodoItemDto>().ForMember(d => d.Priority, 
-                opt => opt.MapFrom(s => (int)s.Priority));
+            ;
         }
     }
killedBy: CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldHaveValidConfiguration; CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldSupportMappingFromSourceToDestination(CA.Mutation.Domain.Entities.TodoItem,CA.Mutation.Application.TodoLists.Queries.GetTodos.TodoI
