[Survived] Block removal mutation
TodoLists/Queries/GetTodos/TodoListDto.cs:8:5
 public class TodoListDto
 {
     public TodoListDto()
-    {
-        Items = Array.Empty<TodoItemDto>();
-    }
+    {}
 
     public int Id { get; init; }

[Killed] Statement mutation
TodoLists/Queries/GetTodos/TodoListDto.cs:24:13
     {
         public Mapping()
         {
-            CreateMap<TodoList, TodoListDto>();
+            ;
         }
     }
killedBy: CA.Mutation.Application.UnitTests.Common.Mappings.MappingTests.ShouldSupportMappingFromSourceToDestination(CA.Mutation.Domain.Entities.TodoList,CA.Mutation.Application.TodoLists.Queries.GetTodos.TodoL
