[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
WeatherForecasts/Queries/GetWeatherForecasts/GetWeatherForecastsQuery.cs:21:37
         return Enumerable.Range(1, 5).Select(index => new WeatherForecast
         {
             Date = DateTime.Now.AddDays(index),
-            TemperatureC = rng.Next(-20, 55),
+            TemperatureC = rng.Next(+20, 55),
             Summary = Summaries[rng.Next(Summaries.Length)]
         });
